{"pages":[{"title":"About Me","text":"​ 程序员小黄，会吃福建人的广东人，面临90后中年危机，爱的人都叫夏洛特。 Roles 华南理工大学SE本科在读 M$ Club技术部指定背锅位 神(hua)出(shui)鬼(mo)没(yu)校园足球边裁 每次签到都慢过107的宿舍长 Projects赶过死线 云计算大作业 建模课大作业 数据库实训 西加加实训 搞过副业 卡片式日记应用开发 俱乐部门户网站开发 BCD实验室软件开发 抱过大腿 BBT SRP ACM GAC 互联网+ 黑客马拉松 微软空间站 看过风景 拼客学院Linux运维训练营 微软亚研2019技术夏令营 Focus 迷恋云计算，操着开发的心选的大数据（非ML狂热粉丝，水平止于调包 逃 FullStack爱好者（实际上是全菜工程师，手持跨平台开发、轻量级应用潜力股，用谷歌全家桶武装大脑 励志成为优秀的软件工程狮+架构狮，respect计算机科学家，认识超棒的设计狮+产品经理 Hobbies 努力为祖国健康打码五十年 诺基亚信仰用户，电子产品云收藏者 左派青年，涉猎文史哲 平权，能出力的出力，能发声的发声 书、歌、剧，赏画有待提高 曾经是一名不合格的剪刀手 热爱小语种，推广文言文 只有篆刻的时候字是允许丑的 FM拜仁Chef Coach，没事踢波 精神健身达人 Links Github Stack Overflow V2EX Zhihu Jianshu Gitee SegmentFault Todos 更新链接 丰富图片 详细介绍","link":"/about/index.html"}],"posts":[{"title":"\\#Machine Learning\\# Artificial Neural Network(10) Introduction","text":"本文主要讨论ANN的重要概念和核心问题，包括以下四个部分： ANN的基本结构 ANN的网络结构 ANN的核心问题 本文参考链接 基本结构单输入神经元多输入神经元网络结构单层神经元多层神经元核心问题 一个网络需要多少层？ 一个层需要多少神经元？ 一个神经元的权重、偏置和传输函数该如何选择？ 参考链接 神经网络（一）：概念","link":"/2019/07/13/Artificial Neural Network(0) Introduction/"},{"title":"\\#Cloud Computing\\# Introduction to Cloud Infrastructure Technologies(0) Introduction","text":"Welcome to LFS151x: Introduction to Cloud Infrastructure Technologies Once you complete this course, you will have a good understanding of the terminology, tools, and technologies associated with today’s top cloud platforms, which can help pave the way to a lucrative career in technology. IntroductionConcept*”Cloud computing is a model for enabling ubiquitous, convenient, on-demand network access to a shared pool of configurable computing resources (e.g. networks, servers, storage, applications, and services) that can be rapidly provisioned and released with minimal management effort or service provider interaction”.* Terms nested virtualization overcommitting Features Speed and AgilityThe required resources are just one click away, which saves time and provides agility. We can also easily scale up or down, depending on our need. CostIt reduces the up-front cost to set up the infrastructure, and allows us to focus on applications and business. Cloud providers have features to estimate the cost, which helps us plan better. Easy Access to ResourcesAs users, we can access our infrastructure from any place and device, as long as we can connect to the provider. MaintenanceAll the maintenance work for the resources is done by the provider. As end users, we do not have to worry about this aspect. Multi-tenancyMultiple users can use the same pool of resources. ReliabilityResources can be hosted in different data center locations, to provide increased reliability. Category Infrastructure as a Service (IaaS) Platform as a Service (PaaS) Software as a Service (SaaS) Model Private CloudIt is designated and operated solely for one organization. It can be hosted internally or externally and managed by internal teams or a third party. We can build a private cloud using a software stack like OpenStack. Public CloudIt is open to the public and anybody can use it after swiping the credit card. Amazon Web Services and Google Compute Engine are examples of public clouds. Hybrid CloudPublic and private clouds are bound together to offer the hybrid cloud. Among other things, a hybrid cloud can be used to: Store sensitive information on a private cloud, while offering public services based on that information from a public cloud. Meet the temporary resources needed from the public cloud. These temporary resources cannot be met from a private cloud.","link":"/2019/07/11/Introduction to Cloud Infrastructure Technologies(0) Introduction/"},{"title":"\\#Machine Learning\\# Artificial Neural Network(2) Multi-layer Perception(MLP)","text":"本文主要讨论多层感知机的概念和应用，包括以下七个部分： 神经网络结构 神经网络流程 神经网络原理 神经网络问题 阐述多层感知机例子 实现多层感知机源码 本文参考链接 结构输入层隐含层 只要隐含的节点足够多，就可以拟合任意函数。 隐含层越多，越容易拟合更复杂的函数。 隐含层的两个属性：每个隐含层的节点数、隐含层的层数。层数越多，每一层需要的节点数就会越少。 ![multi-layer perception](/images/multi-layer perception.png) 输出层流程我们的任务就是找到权值和偏置这些参数的值，使得输出的东西让我们满意，达到我们的要求。 前向过程 -&gt; 预测反向过程 -&gt; 训练原理通过合理地改变权值和偏置一点点的方式来让这个神经网络最后的结果向我们预期的结果进军，激活函数的选择对于神经网络的训练来说，也是很重要的。 ![delta change](/images/delta change.webp) 问题过拟合 Q：模型拟合训练数据，泛化性较差，测试数据效果不好。 A：Dropout，在神经网络的层中，随机丢弃一些点，并且加强剩余的点，学习含有噪声的数据，增强模型的泛化性。 局部最优 Q：神经网络不是一个凸优化问题，存在大量的局部最优点，然而，神经网络的局部最优正好可以达到比较好的效果，全局最优反而容易拟合。 A：Adagrad，减少计算参数的复杂度，学习速率先快后慢，恰好达到局部最优。 梯度弥散 Q：神经网络的的激活函数，将信息上一层传递至下一层的变换，使模型学习到更加高阶的特征。Sigmoid函数，在反向传播中，梯度会急剧减少；Softplus是单侧抑制，即负值转换为正值，但没有稀疏激活性，即没有0状态。真正的神经元具有稀疏性，根据输入信号，选择响应或是屏蔽。 A：ReLU，y=max(0,x)，将负值抑制为0，即非激活状态，正值反馈。 例子以MNIST手写体为例子： 读取数据集（28×28的灰度图） 展开为一维（含有784个单元） 对于输入层而言，我们可以“设定”784个单元，分别接受每一个像素的值 对于输出层而言，我们可以只设定一个神经元，用来输出这个数字是几，我们也可以设定10个神经元，分别代表0到9，然后输出这个那个数字更加有可能 从上面看，设计输入层和输出层还是比较轻松的，但是设计隐藏层是比较难的，后面再讨论 训练神经网络 确定损失函数 随机梯度下降 测试神经网络 源码以MNIST手写体为例子： 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859import tensorflow as tffrom tensorflow.examples.tutorials.mnist import input_data\"\"\"读取数据\"\"\"mnist = input_data.read_data_sets(\"MNIST_data\", one_hot=True) # 读取数据集sess = tf.InteractiveSession() # 创建交互会话\"\"\"创建模型\"\"\"in_units = 28 * 28 # 输入层有784个单元h1_units = 300 # 隐含层1有300个单元out_units = 10 # 输出层有10个单元# 初始化隐藏层W1# 使用truncated_normal加噪，防止正态分布的完全对称W1 = tf.Variable(tf.truncated_normal([in_units, h1_units], stddev=0.1))# 初始化隐藏层b1# 矩阵用大写字母，向量用小写字母b1 = tf.Variable(tf.zeros[h1_units])# 初始化输出层W2W2 = tf.Variable(tf.zeros([h1_units, out_units]))# 初始化输出层b2b2 = tf.Variable(tf.zeros([out_units]))# 回归函数：y = wx + b# 激活函数：ReLUx = tf.placeholder(tf.float32, [None, in_units]) # 输入层h1 = tf.nn.relu(tf.matmul(x, W1) + b1) # 隐藏层keep_prob = tf.placeholder(tf.float32) # dropout的保留比率h1_dropout = tf.nn.dropout(h1, keep_prob) # 隐藏层的dropouty = tf.nn.softmax(tf.matmul(h1, W2) + b2) # 输出层# 损失函数：标准的交叉熵y_ = tf.placeholder(tf.float32, [None, out_units]) # 待训标签cross_entroy = tf.reduce_mean(tf.reduce_sum(y_ * tf.log(y), reduction_indices=[1])) # 交叉熵train_step = tf.train.AdagradDAOptimizer(0.3) # 训练步长# 初始化全部变量tf.global_variables_initializer().run()\"\"\"训练模型\"\"\"# 循环训练模型3000次，每次随机采样100个数据# Feed三类数据：数据x，标签y_，dropout的保留比率keep_probfor i in range(3000): batch_xs, batch_ys = mnist.train.next_batch(100) # 随机采样 train_step.run({x: batch_xs, y_: batch_ys, keep_prob: 0.75}) # 训练数据\"\"\"测试模型\"\"\"# argmax选择最大数的索引，全部数据求平均# keep_prob设置为1，不丢弃任何信息correct_pred = tf.equal(tf.argmax(y, 1), tf.argmax(y_, 1))accuracy = tf.reduce_mean(tf.cast(correct_pred, tf.float32))# 计算并输出准确率结果print(accuracy.eval({x: mnist.test.image, y_: mnist.test.labels, keep_prob: 1.0})) 参考链接 深度学习笔记二：多层感知机（MLP）与神经网络结构 MNIST数据集下载 MNIST数据集介绍及读取 人工智能 - 多层感知机 MLP [3]","link":"/2019/07/13/Artificial Neural Network(2) Multi-layer Perception(MLP)/"},{"title":"\\#Cloud Computing\\# Introduction to Cloud Infrastructure Technologies(1) Virtualization","text":"Welcome to LFS151x: Introduction to Cloud Infrastructure Technologies By the end of this chapter, you should be able to: Describe the different types of virtualization. Explain how hypervisors can be used to create virtual machines. Create and configure virtual machines automatically, using KVM, VirtualBox and Vagrant. VirtualizationConcept*”In computing, virtualization refers to the act of creating a virtual (rather than actual) version of something, including virtual computer hardware platforms, operating systems, storage devices, and computer resources”.* KVM VirtualBox VirtualBox is distributed under the GNU General Public License (GPL) version 2. VagrantConcept*”Configuring and sharing one VM is easy, but, when we have to deal with multiple VMs for the same project, doing everything manually can be tiresome. Vagrant by HashiCorp helps us automate the setup of one or more VMs by providing an end-to-end lifecycle using the vagrant command line. Vagrant is a cross-platform tool. It can be installed on Linux, Mac OSX, and Windows. We have to use different providers, depending on the OS. It has recently added support for Docker, which can help us manage Docker containers.“* Features Boxes We need to provide an image in the Vagrantfile, which we can use to instantiate machines. In the example above, we have used centos/7 as the base image. If the image is not available locally, then it can be downloaded from a central repository like Atlas, which is the image repository provided by HashiCorp. We can version these images and use them depending on our need, by updating the Vagrantfile accordingly. Vagrant Providers Providers are the underlying engine/hypervisor used to provision a machine. By default, Vagrant supports VirtualBox, Hyper-V and Docker. We also have custom providers, like KVM, AWS, etc. VirtualBox is the default provider. Synced Folders With the Synced Folder feature, we can sync a directory on the host system with a VM, which helps the user manage shared files/directories easily. For example, in the above example, if we un-comment the line below from Vagrantfile, then the ../data folder from the current working directory of the host system would be shared with the /vagrant_data file on the VM. 1config.vm.synced_folder &quot;../data&quot;, &quot;vagrant_data&quot; ProvisioningProvisioners allow us to automatically install software, make configuration changes, etc. after the machine is booted. It is a part of the vagrant up process. There are many types of provisioners available, such as File, Shell, Ansible, Puppet, Chef, Docker, etc. In the example below, we used Shell as the provisioner to install the vim package. 123config.vm.provision &quot;shell&quot;, inline: &lt;&lt;-SHELL yum install vim -ySHELL PluginsWe can use plugins to extend the functionality of Vagrant. VagrantFile VagrantCmd vagrant up: start VM vagrant halt: stop VM vagrant destory: delete VM vagrant status: check status vagrant user: login in as user","link":"/2019/07/11/Introduction to Cloud Infrastructure Technologies(1) Virtualization/"},{"title":"\\#Cloud Computing\\# Introduction to Cloud Infrastructure Technologies(2) Infrastructure as a Service (IaaS)","text":"Welcome to LFS151x: Introduction to Cloud Infrastructure Technologies By the end of this chapter, you should be able to: Explain the concept of Infrastructure as a Service (IaaS). Distinguish between different IaaS providers. Provision a virtual machine on top of different IaaS providers. Infrastructure as a Service (IaaS)Concept“Infrastructure as a Service (IaaS) is a form of cloud computing which provides on-demand physical and virtual computing resources, storage, network, firewall, load balancers, etc. To provide virtual computing resources, IaaS uses some form of hypervisor, like Xen, KVM, VMware ESX/ESXi, Hyper-V, etc.ther than VMs, some IaaS providers offer bare metal machines for provisioning”. Amazon EC2Concept*”Amazon Web Services (AWS) is one of the leaders in providing different cloud services. With Amazon Elastic Compute, Amazon provides the IaaS infrastructure, on which most of the other services are built. We can manage compute resources from the Amazon EC2 web interface and can scale up or down, depending on the need. AWS also offers a command line to manage the instances from the command line. Amazon EC2 uses XEN and KVM hypervisors to provision compute resources”.* Features Amazon EC2 offers compute instances for different resources, which we can choose from depending on our need. Amazon EC2 provides some preconfigured images, called Amazon Machine Images (AMIs). These images can be used to quickly start instances. We can also create our own custom AMIs to boot our instances. One important aspect to note is that Amazon supports configuring security and network access to our instances. With Amazon Elastic Block Store (EBS) we can attach/detach persistent storage to our instances. EC2 supports the provisioning of dedicated hosts, which means we can get an entire physical machine for our use. Create an Elastic IP for remapping the Static IP address automatically. Provision a Virtual Private Cloud for isolation. Amazon Virtual Private Cloud provides secure and robust networking for Amazon EC2 instances. Use CloudWatch for monitoring resources and applications. Use Auto Scaling to dynamically resize your resources, etc. Azure Virtual MachineConcept‘“Azure is Microsoft’s cloud offering, which has products in different domains, such as compute, web and mobile, data and storage, Internet of Things, and many others. Through Azure Virtual Machine, Microsoft provides compute provisioning and management: We can manage Virtual Machines from Azure’s web interface. Azure also provides a command line utility to manage resources and applications on the Azure cloud”. Features Azure lets you choose between different tiers, based on the usage and the operating systems or the predefined application virtual machines (SharePoint, Oracle, etc.). Using Resource Manager templates, we can define the template for the virtual machine deployment. Azure offers other features as well, like making seamless hybrid connections, faster I/O in certain types of tiers, backups, etc. Google Compute EngineConcept”Google Cloud Platform is Google’s Cloud offering, which has many products in different domains, like compute, storage, networking, big data, and others. Google Compute Engine provides the compute service. We can manage the instances through GUI, APIs or command line. Access to the individual VM’s console is also available“. Features GCE supports different machine types, which we can choose from depending on our need. GCE has other features as well, like Persistent Disk, Local SSD, Global Load Balancing, Compliance and Security, Automatic Discount, etc. DigitalOceanConcept*”DigitalOcean helps you create a simple cloud quickly, in as little as 55 seconds. All of the VMs are created on top of the KVM hypervisor and have SSD (Solid-State Drive) as the primary disk.”* Features Based on your need, DigitalOcean offers different plans. DigitalOcean provides other features, like Floating IPs, Shared Private Networking, Load Balancers, Team Accounts, etc. It offers a one-click installation of a multitude of application stacks like LAMP, LEMP, MEAN, and Docker. OpenStackConcept*”With OpenStack, we can offer a cloud computing platform for public and private clouds. Other than providing a IaaS solution, OpenStack has evolved over time to provide other services, like Database, Storage, etc”.* FeaturesDue to the modular nature of OpenStack, anyone can add additional components to get specific features or functionality. Some of the major OpenStack components are KeystoneProvides Identity, Token, Catalog, and Policy services to projects. NovaProvides on-demand compute resources. HorizonProvides the Dashboard, which is a web-based user interface to manage the OpenStack service. NeutronImplements the network as a service and provides network capabilities to different OpenStack components. GlanceProvides a service where users can upload and discover data assets, like images and metadata. SwiftProvides a highly available, distributed, eventually consistent object/blob store. CinderProvides block storage as a service. HeatProvides a service to orchestrate composite cloud applications, using a declarative template format through an OpenStack-native REST API. CeilometerIt is part of the Telemetry project and provides data collection services for billing and other purposes. Each of the OpenStack components is also modular by design. For example, with Nova we can select an underneath hypervisor depending on the requirement, which can be either libvirt (qemu/KVM), Hyper-V, VMware, XenServer, Xen via libvirt.","link":"/2019/07/12/Introduction to Cloud Infrastructure Technologies(2) Infrastructure as a Service (IaaS)/"},{"title":"\\#Cloud Computing\\# Introduction to Cloud Infrastructure Technologies(3) Platform as a Service (PaaS)","text":"Welcome to LFS151x: Introduction to Cloud Infrastructure Technologies By the end of this chapter, you should be able to: Explain the concept of Platform as a Service (PaaS). Distinguish between different PaaS providers. Deploy an application on top of different PaaS providers: Cloud Foundry, OpenShift, Heroku. Platform as a Service (PaaS)Concept*”Platform as a Service (PaaS) is a class of cloud computing services which allows its users to develop, run, and manage applications without worrying about the underlying infrastructure. With PaaS, users can simply focus on building their applications, which is a great help to developers. We can either use PaaS services offered by different cloud computing providers like Amazon, Google, Azure, etc., or deploy it on-premise, using software like OpenShift Origin. PaaS can be deployed on top of IaaS, or, independently on VMs, bare metal, and containers”.* Cloud FoudryConcept*”Cloud Foundry CF) is an open source Platform as a Service (PaaS) that provides a choice of clouds, developer frameworks, and application services. It can be deployed on-premise or on IaaS, like AWS, vSphere, or OpenStack. There are many commercial CF cloud providers as well, like IBM Cloud Foundry, SAP Cloud Platform, Pivotal Cloud Foundry, etc”.* FeaturesAmong the characteristics employed by Cloud Foundry are the following: Application portability Application auto-scaling Centralized platform management Centralized logging Dynamic routing Application health management Role-based application deployment Horizontal and vertical scaling Security Support for different IaaS technologies. CF Application RuntimeConcept*”CF Application Runtime, previously known as Elastic Runtime, is used by developers to run applications written in any language or framework on the cloud of their choice”.* Features CF Application Runtime uses buildpacks, which provide the framework and runtime support for the applications. They are programming language-specific and have information about how to download dependencies and configure specific applications. Developers can build new buildpacks or customize the existing ones. In addition, by using the Open Service Broker API, we can connect our application to external services like databases or third-party SaaS providers. As presented in the graphic below, the CF Application Runtime platform can manage the entire workflow and lifecycle of the application, from routing to logging. CF Container RuntimeConcept*”CF Container Runtime gives Cloud Foundry the flexibility to deploy developer-built, pre-packaged applications using containers”.* Features BOSH is a cloud-agnostic open source tool for release engineering, deployment, and lifecycle management of complex distributed systems. Kubernetes is a container orchestrator which allows us to deploy containers. The CF Container Runtime platform does it by deploying containers on a Kubernetes cluster, which is managed by CF BOSH. With CF BOSH, you can achieve high availability, scaling, VM healing and upgrades for the Kubernetes cluster. OpenShiftConcept*”OpenShift is an open source PaaS solution provided by Red Hat. It is built on top of the container technology, which uses Kubernetes underneath. OpenShift can be deployed on top of a full-fledged Linux OS or on a Micro OS which is specifically designed to run containers and Kubernetes”.* Features With OpenShift, we can deploy containerized applications. With application images and QuickStart application templates, applications can be deployed with one click. As OpenShift uses Kubernetes, we get all the features offered by Kubernetes, like adding or removing nodes at runtime, persistent storage, auto-scaling, etc. OpenShift has a framework called Source to Image (S2I), which enables us to create container images from the source code repository to deploy applications easily. OpenShift integrates well with Continuous Deployment tools to deploy applications as part of the CI/CD pipeline. With CLI, GUI and IDE integration applications can be managed easily. It enables application portability, meaning that any application created on OpenShift can run on any platform that supports Docker. OpenShift integrated Docker registry, automatic edge load balancing, cluster logging, and integrated metrics. HerokuConcept“Heroku is a fully-managed container-based cloud platform, with integrated data services and a strong ecosystem. Heroku is used to deploy and run modern applications”. Applications should contain the source code, its dependency information and the list of named commands to be executed to deploy it, in a file called Procfile. For each supported language, it has a pre-built image which contains a compiler for that language. This pre-built image is referred to as a buildpack. Multiple buildpacks can be used together. We can also create a custom buildpack. While deploying, we need to send the application’s content to Heroku, either via Git, GitHub, Dropbox or via an API. Once the application is received by Heroku, a buildpack is selected based on the language of preference. To create the runtime which is ready for execution, we compile the application after fetching its dependency and configuration variables on the selected buildpack. This runtime is often referred to as a slug. We can also use third party add-ons to get access to value-added services like logging, caching, monitoring, etc. A combination of slug, configuration variables, and add-ons is referred to as a release, on which we can perform upgrade or rollback. Depending on the process-type declaration in the Procfile, a virtualized UNIX container is created to serve the process in an isolated environment, which can be scaled up or down, based on the requirements. Each virtualized UNIX container is referred to as a dyno. Each dyno gets its own ephemeral storage. Dyno Manager manages dynos across all applications running on Heroku. Features Individual components of an application can be scaled up or down using dynos. It is a very rich ecosystem, and it allows us to extend the functionality of an application with add-ons. Add-ons allow us to easily integrate our applications with other fully-managed cloud services like database, logging, email, etc. Applications can be easily integrated with Salesforce. It enables a development-friendly workflow. It provides the ability to do automated backups.","link":"/2019/07/12/Introduction to Cloud Infrastructure Technologies(3) Platform as a Service (PaaS)/"},{"title":"\\#Configuration\\# 从零到壹：GitHub Pages + Hexo = Blog","text":"利用GitHub Pages+Hexo打造一个个人博客，主要分为以下五个部分： 环境准备 Environment 文件配置 Configuration 个性化 Customization 博客写作 Writing 双备份 Backup 环境准备 Environment安装Git + Github 安装Git部署插件: 1$ npm install hexo-deployer-git --save 安装Node.js 安装Node.js: Download | Node.js 检查是否安装成功: 12$ node -v$ npm -v 安装Hexo 安装Hexo: 1$ npm install -g hexo-cli 检查是否安装成功: 1$ hexo -v 初始化: 1$ hexo init blog 文件配置 Configuration本地运行123$ hexo clean # 删除缓存$ hexo g # 生成Hexo页面$ hexo s # 本地部署Hexo页面 远程运行123$ hexo clean # 删除缓存$ hexo g # 生成Hexo页面$ hexo d # 远程部署Hexo页面 基本配置/_config.yml 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273747576777879808182838485# Hexo Configuration## Docs: https://hexo.io/docs/configuration.html## Source: https://github.com/hexojs/hexo/# Sitetitle: LotteWong # 个人博客显示名称subtitle: 在代码符号表象中避难。 # 个人博客副标题description: # 搜索引擎描述信息keywords: # 搜索引擎关键词author: LotteWong # 网站作者avatar: ./themes/icarus/source/images/favicon.ico # 网站头像language: en # 网站语言timezone: Asia/HongKong # 网站时区# URL## If your site is put in a subdirectory, set url as 'http://yoursite.com/child' and root as '/child/'url: http://yoursite.comroot: /permalink: :year/:month/:day/:title/permalink_defaults:# Directorysource_dir: sourcepublic_dir: publictag_dir: tagsarchive_dir: archivescategory_dir: categoriescode_dir: downloads/codei18n_dir: :langskip_render:# Writingnew_post_name: :title.md # File name of new postsdefault_layout: posttitlecase: false # Transform title into titlecaseexternal_link: true # Open external links in new tabfilename_case: 0render_drafts: falsepost_asset_folder: falserelative_link: falsefuture: truehighlight: enable: true line_number: true auto_detect: false tab_replace: # Home page setting# path: Root path for your blogs index page. (default = '')# per_page: Posts displayed per page. (0 = disable pagination)# order_by: Posts order. (Order by date descending by default)index_generator: path: '' per_page: 10 order_by: -date # Category &amp; Tagdefault_category: uncategorizedcategory_map:tag_map:# Date / Time format## Hexo uses Moment.js to parse and display date## You can customize the date format as defined in## http://momentjs.com/docs/#/displaying/format/date_format: YYYY-MM-DDtime_format: HH:mm:ss# Pagination## Set per_page to 0 to disable paginationper_page: 10pagination_dir: page# Extensions## Plugins: https://hexo.io/plugins/## Themes: https://hexo.io/themes/plugins: # 设置个人博客插件theme: icarus # 设置个人博客主题# Deployment## Docs: https://hexo.io/docs/deployment.htmldeploy: type: git # 部署类型 repo: git@github.com:LotteWong/lottewong.github.io.git # 部署仓库 branch: master # 部署分支 个性化 Customization/themes/icarus/_config.yml 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181182183184185186187188189190191192193194195196197198199200201202203204205206207208209210211212213214215216217218219220221222223224225226227228229230231232233234# Version of the Icarus theme that is currently usedversion: 2.3.0# Path or URL to the website's iconfavicon: /images/favicon.ico# Path or URL to RSS atom.xmlrss: # Path or URL to the website's logo to be shown on the left of the navigation bar or footerlogo: /images/logo.png# Open Graph metadata# https://hexo.io/docs/helpers.html#open-graphopen_graph: # Facebook App ID # fb_app_id: # Facebook Admin ID # fb_admins: # Twitter ID # twitter_id: # Twitter site # twitter_site: # Google+ profile link # google_plus: # Navigation bar link settingsnavbar: # Navigation bar menu links menu: Home: / Archives: /archives Categories: /categories Tags: /tags About: /about # Navigation bar links to be shown on the right # links: # Download on GitHub: # icon: fab fa-github # url: 'https://github.com/LotteWong'# Footer section link settingsfooter: # Links to be shown on the right of the footer section links: Github: icon: fab fa-github url: 'https://github.com/LotteWong' RSS: icon: fas fa-rss url: 'https://www.zhihu.com/people/lai-xiu-ping'# Article display settingsarticle: # Code highlight theme # https://github.com/highlightjs/highlight.js/tree/master/src/styles highlight: atom-one-light # Whether to show article thumbnail images thumbnail: true # Whether to show estimate article reading time readtime: true# Search plugin settings# https://ppoffice.github.io/hexo-theme-icarus/categories/Plugins/Searchsearch: # Name of the search plugin type: insight# Comment plugin settings# https://ppoffice.github.io/hexo-theme-icarus/categories/Plugins/Commentcomment: # Name of the comment plugin type: # Donation entries# https://ppoffice.github.io/hexo-theme-icarus/categories/Donation/donate: - # Donation entry name type: alipay # Qrcode image URL qrcode: '/images/alipay.png' - # Donation entry name type: wechat # Qrcode image URL qrcode: '/images/wechat.png' - # Donation entry name type: paypal # Paypal business ID or email address business: 'SuperGsama@outlook.com' # Currency code currency_code: USD - # Donation entry name # type: patreon # URL to the Patreon page # url: ''# Share plugin settings# https://ppoffice.github.io/hexo-theme-icarus/categories/Plugins/Shareshare: # Share plugin name type: # Sidebar settings.# Please be noted that a sidebar is only visible when it has at least one widgetsidebar: # left sidebar settings left: # Whether the left sidebar is sticky when page scrolls # https://ppoffice.github.io/hexo-theme-icarus/Configuration/Theme/make-a-sidebar-sticky-when-page-scrolls/ sticky: false # right sidebar settings right: # Whether the right sidebar is sticky when page scrolls # https://ppoffice.github.io/hexo-theme-icarus/Configuration/Theme/make-a-sidebar-sticky-when-page-scrolls/ sticky: false# Sidebar widget settings# https://ppoffice.github.io/hexo-theme-icarus/categories/Widgets/widgets: - # Widget name type: profile # Where should the widget be placed, left or right position: left # Author name to be shown in the profile widget author: LotteWong # Title of the author to be shown in the profile widget author_title: SCUT, Undergraduate # Author's current location to be shown in the profile widget location: Guangzhou, China # Path or URL to the avatar to be shown in the profile widget avatar: # Email address for the Gravatar to be shown in the profile widget gravatar: # Whether to show avatar image rounded or square avatar_rounded: false # Path or URL for the follow button follow_link: 'https://www.jianshu.com/u/80ee6b6f3418' # Links to be shown on the bottom of the profile widget social_links: Project: icon: fab fa-creative-commons url: 'https://github.com/scutse-man-month-myth/InkYear' Organization: icon: fab fa-creative-commons-by url: 'https://github.com/scutse-man-month-myth' Developer: icon: fab fa-github url: 'https://github.com/LotteWong' #Facebook: #icon: fab fa-facebook #url: 'https://facebook.com' #Twitter: #icon: fab fa-twitter #url: 'https://twitter.com' #Dribbble: #icon: fab fa-dribbble #url: 'https://dribbble.com' - # Widget name type: toc # Where should the widget be placed, left or right position: left - # Widget name type: links # Where should the widget be placed, left or right position: left # Links to be shown in the links widget links: Dart: 'https://dart.dev/' Flutter: 'https://flutter.dev/' - # Widget name type: category # Where should the widget be placed, left or right position: left - # Widget name type: tagcloud # Where should the widget be placed, left or right position: left - # Widget name type: recent_posts # Where should the widget be placed, left or right position: right - # Widget name type: archive # Where should the widget be placed, left or right position: right - # Widget name type: tag # Where should the widget be placed, left or right position: right# Other plugin settingsplugins: # Enable page animations animejs: true # Enable the lightGallery and Justified Gallery plugins # https://ppoffice.github.io/hexo-theme-icarus/Plugins/General/gallery-plugin/ gallery: true # Enable the Outdated Browser plugin # http://outdatedbrowser.com/ outdated-browser: true # Enable the MathJax plugin # https://ppoffice.github.io/hexo-theme-icarus/Plugins/General/mathjax-plugin/ mathjax: true # Show the back to top button on mobile devices back-to-top: true # Google Analytics plugin settings # https://ppoffice.github.io/hexo-theme-icarus/Plugins/General/site-analytics-plugin/#Google-Analytics google-analytics: # Google Analytics tracking id tracking_id: # Baidu Analytics plugin settings # https://ppoffice.github.io/hexo-theme-icarus/Plugins/General/site-analytics-plugin/#Baidu-Analytics baidu-analytics: # Baidu Analytics tracking id tracking_id: # Hotjar user feedback plugin # https://ppoffice.github.io/hexo-theme-icarus/Plugins/General/site-analytics-plugin/#Hotjar hotjar: # Hotjar site id site_id: # Show a loading progress bar at top of the page progressbar: true # Show the copy button in the highlighted code area clipboard: true # BuSuanZi site/page view counter # https://busuanzi.ibruce.info busuanzi: false# CDN provider settings# https://ppoffice.github.io/hexo-theme-icarus/Configuration/Theme/speed-up-your-site-with-custom-cdn/providers: # Name or URL of the JavaScript and/or stylesheet CDN provider cdn: jsdelivr # Name or URL of the webfont CDN provider fontcdn: google # Name or URL of the webfont Icon CDN provider iconcdn: fontawesome 博客写作 Writing 默认 1$ hexo new \"blog title\" 自定义 1234567891011title: {{ blog title }}categories: {{ blog category }}tags:- {{ blog tag }}thumbnail: {{ blog thumbnail }}{{ Abstract }}&lt;!-- more --&gt;{{ Content }} 双备份 Backup Hexo备份: 12# master branch$ hexo d Src备份: 12345# dev branch$ git checkout dev$ git add --all$ git commit -m \"new blog\"$ git push origin dev 待办事项 Todos 对应图标 更多插件 绑定域名 更新外链 参考链接 References GitHub+Hexo 搭建个人网站详细教程 Hexo icarus","link":"/2019/07/10/从零到壹：GitHub Pages + Hexo = Blog/"},{"title":"\\#Machine Learning\\# Artificial Neural Network(1) Single-layer Perception(SLP)","text":"本文主要讨论单层感知机的概念和应用，包括以下六个部分： 单层感知机的结构 单层感知机的训练 单层感知机的应用 单层感知机的算法 本文关键术语 本文参考链接 结构一般结构单神经元感知机多神经元感知机训练学习规则概念训练最终任务具体学习规则 蒙特卡罗初始化 对w： ✖ 直接令权值矩阵w等于第一个输入 ✔ 将p加/减到w上面使得w更加偏向于p 对b： b_new = b_old + e 通过则读取下一个p，不通过则进行再适应，直至无输入后训练完成 ⭐ 应用❗ 算法自适应线性神经元网络 ADALINE Network 和传统感知机唯一不同的是它使用的是一个线性传输函数 最小均方算法 LMS 正确行为样本集合 均方误差表达式 相关矩阵表达式 最小均方算法流程 关键术语假设空间 感知机使用的传输函数为对称硬极限函数 对于单个神经元的单层感知机，输出只为1或-1，所以感知机是一种线性分类模型$$a = hardlims(n) =\\begin{cases}1,\\quad n\\geq 0\\\\-1,\\quad n&lt;0\\end{cases}$$ 感知机的假设空间是定义在特征空间中的所有线性分类模型或者线性分类器，即函数集合$${f | f(x) = w · x + b}$$ 判定边界 判定边界由那些使得净输入n为零的输入向量确定 右上阴影区任意输入向量和权值向量的内积 &gt; -b，左下阴影区任意输入向量和权值向量的内积 &lt; -b 右上阴影区任意输入向量和权值向量的输出a = 1，左下阴影区任意输入向量和权值向量的输出a = -1 权值向量总是指向神经元输出为1的区域 参考链接 神经网络（二）：感知机","link":"/2019/07/13/Artificial Neural Network(1) Single-layer Perception(SLP)/"}],"tags":[{"name":"ANN","slug":"ANN","link":"/tags/ANN/"},{"name":"Introduction","slug":"Introduction","link":"/tags/Introduction/"},{"name":"Virtualization","slug":"Virtualization","link":"/tags/Virtualization/"},{"name":"IaaS","slug":"IaaS","link":"/tags/IaaS/"},{"name":"PaaS","slug":"PaaS","link":"/tags/PaaS/"},{"name":"GitHub Pages","slug":"GitHub-Pages","link":"/tags/GitHub-Pages/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"}],"categories":[{"name":"Machine Learning","slug":"Machine-Learning","link":"/categories/Machine-Learning/"},{"name":"Cloud Computing","slug":"Cloud-Computing","link":"/categories/Cloud-Computing/"},{"name":"Configuration","slug":"Configuration","link":"/categories/Configuration/"}]}